# RemoveSplit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..RemoveSplit Method
ViewCropRegionShapeManager Class See Also
---
Removes any split applied to the view's crop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RemoveSplit()
```

Visual Basic
---
```text
Public Sub RemoveSplit
```

Visual C++
---
```text
public:
void RemoveSplit()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The crop of the associated view is not permitted to have multiple regions. |

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace